src/Documents/ЗакупкаТоваров/ЗакупкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакупкаТоваров</name>
  <registerRecords>AccountingRegister.РегистрБухУчет</registerRecords>
  <registerRecords>AccumulationRegister.Задолженности</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ЦенаТовара/ЦенаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦенаТовара</name>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ЗакупкаТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	//При изменении цены автоматически вычисляется сумма
	ТекущиеДанныеТовары = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Количество * ТекущиеДанныеТовары.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	//При изменении количества автоматически вычисляется сумма
	ТекущиеДанныеТовары = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Количество * ТекущиеДанныеТовары.Цена;
КонецПроцедуры




 //Достаем цену закупа из регистра сведений
&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатурыНаСервере(Номенклатура)
	ЗначениеРесурсов = РегистрыСведений.ЦенаТовара.Получить(Новый Структура("Номенклатура", Номенклатура));
	
	//Если запись с этим товаром есть - берем цену
	//Если нет - ставим 0
	Если ЗначениеРесурсов <> Неопределено Тогда
		Возврат ЗначениеРесурсов.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции


//Подставляем цену из регистра сведений в форму
&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	//Если товаров нет, то и подставлять нечего
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Товар) Тогда
		СтрокаТабличнойЧасти.Цена = 0;
		СтрокаТабличнойЧасти.Сумма = 0;
		Возврат;
	КонецЕсли;
	
	ЦенаИзРегистра = ПолучитьЦенуНоменклатурыНаСервере(СтрокаТабличнойЧасти.Товар);
	
	
	//Подставляем цену, полученную из функции и вычисляем сумму
	СтрокаТабличнойЧасти.Цена = ЦенаИзРегистра; 
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * ЦенаИзРегистра;
КонецПроцедуры
